

keyword_list = ['종목', '업종', '수급', '산업', '테마', '공모주', '배당주'
                , '주가지수', '미국채권금리', '대체투자'
                , '관련기관', '발표', '전망'
                , '실적발표', '물가지표', '경제지표', '배당일'
                , 'ETF', '중개형ISA', '펀드', '개인연금', '퇴직연금', 'ELS', 'DLS', 'CMA', '발행어음', '채권', '신탁', 'WRAP', 'RP'
                , '암호화폐', '미술품', '조각투자'
                , '시장', '제도'
                , '리워드', '캐시백', '혜택', '짠테크'
                ]


keyword_list_f = ['종목', '공모주', '배당주', '주가지수', '대체투자', '경제지표', 'ETF', '중개형ISA', '펀드', '개인연금', '퇴직연금', 'ELS', 'CMA', '발행어음', '채권', '신탁'
                    , 'WRAP', 'RP', '암호화폐', '미술품', '조각투자', '캐시백']


main_list = ['주식', '지수', '금리', '주요일정', '금융상품', '디지털자산', '부동산', '세금', '재테크', '경제', '금융', '금융용어', '경제용어', '제도', '경제정책', '소비', '보험', '부자']


main_list_f = ['주식', '금리', '금융상품', '디지털자산', '부동산', '세금', '재테크', '경제', '금융', '보험']


test = ['ELB', 'DCT', 'ETN', '관련주', '테마주', '수혜주']

test_f = ['관련주', '테마주']


keyword_test = ['종목', '공모주', '배당주', '주가지수', '대체투자', '경제지표', 'ETF', '중개형ISA', '펀드', '개인연금', '퇴직연금', 'ELS', 'CMA', '발행어음', '채권', '신탁', 
                'WRAP', 'RP', '암호화폐', '미술품', '조각투자', '캐시백', '주식', '금리', '금융상품', '디지털자산', '부동산', '세금', '재테크', '경제', '금융', '보험', '관련주', '테마주']


keyword_test_2 = ['종목', '공모주', '배당주', '주가지수',  '경제지표', 'ETF', '중개형ISA', '펀드', '개인연금', '퇴직연금', 'ELS', 'CMA',  '채권', '신탁', 
                'RP', '암호화폐', '미술품', '조각투자', '캐시백', '주식', '금리', '금융상품', '디지털자산', '부동산', '세금', '재테크', '경제', '금융', '보험', '테마주']

keyword_final_tmp = ['주식', '대체자산', '금리', '금융상품', '디지털자산', '부동산', '세금', '재테크', '내돈관리', '테마주', '특징주', '외국인매수', '기관매수', '급등주', '공모주',
                     '배당주', '미국주식', '배당금', '주가지수', '미국주식실적발표', '글로벌투자대가', '원자재', '원유', '금값', '미국채권금리', '달러환율', '한국금리', '미국금리', 'FOMC',
                     'CPI', 'ETF', '중개형ISA', '펀드', '개인연금', '퇴직연금', 'ELS', 'DLS', 'CMA', '발행어음', '채권', '신탁' ,'WRAP', 'RP', '암호화폐', '미술품', '조각투자', '부동산전망',
                     '아파트청약', '제도', '리워드', '캐시백', '짠테크', '연금', '법률', '보험', '제도']

# keyword_final = ['주식', '금리', '금융상품', '디지털자산', '부동산', '세금', '재테크', '테마주', '특징주', '급등주', '공모주',
#                      '배당주', '미국주식', '주가지수', '원자재', '금값', '달러환율', '미국금리',
#                      'ETF', '중개형ISA', '개인연금', '퇴직연금', 'ELS', 'DLS', 'CMA', '채권', '신탁', 'RP', '암호화폐', '미술품', '조각투자', '부동산전망',
#                      '아파트청약', '리워드', '캐시백', '연금', '법률', '보험']

keyword_final = ['주식', '금리', '금융상품', '디지털자산', '부동산', '세금', '재테크', '돈버는법', '테마주', '특징주', '외국인순매수', '신규상장', '급등주', '공모주',
                     '배당주', '미국주식', '주가지수', 'WTI', '금값', '채권금리', '달러환율', '미국금리',
                     'ETF', '중개형ISA', '적립식펀드', '개인연금', '퇴직연금', 'ELS', 'CMA통장', 'CMA금리비교', '채권', '신탁', 'RP', '암호화폐', '미술품', '조각투자', 
                     '아파트청약', '리워드', '캐시백', '돈버는앱', '건강보험', '자동차보험', '의료비보험', '상속', '증여']

